import React from 'react';
import './style.css';

const Activities = () => {
  const activities = [
    {
      id: 1,
      image: 'https://www.lannapoly.ac.th/web/gallery/20241121-100726.jpg', // เปลี่ยนเป็นรูปจริง
      title: 'แสดงความยินดีต้อนรับผู้อำนวยการ นางสาวนารีรัตน์ ธจิตธรรม',
      description: 'อาจารย์วุฒิพงศ์ พวงไม้มิ่ง ผู้ช่วยรองผู้อำนวยการฝ่ายกิจการนักศึกษา พร้อมทีมงานแนะแนวการศึกษา เข้าร่วมแสดงความยินดีต้อนรับผู้อำนวยการ นางสาวนารีรัตน์ ธจิตธรรม เข้ารับตำแหน่งผู้อำนวยการโรงเรียนแม่ออนวิทยาลัย ณ หอประชุมโรงเรียนแม่ออนวิทยาลัย',
    },
    {
      id: 2,
      image: 'https://www.lannapoly.ac.th/web/gallery/20241119-112909.jpg',
      title: 'ร่วมพิธีเปิดการฝึกภาคปกตินักศึกษาวิชาทหารชั้นปีที่ 4 และ ปีที่ 5 ประจำปีการศึกษา 2567',
      description: 'ผกท.พ.ประสิทธิ์ ชูดวง รองผู้อำนวยการฝ่ายกิจการนักศึกษาและ ผกท. วิทยาลัยเทคโนโลยีโปลิเทคนิคลานนาเชียงใหม่ เข้าร่วมพิธีเปิดการฝึกภาคปกตินักศึกษาวิชาทหารชั้นปีที่ 4 และ ปีที่ 5 ประจำปีการศึกษา 2567 ณ ศูนย์การฝึกนักศึกษาวิชาทหารมณฑลทหารบกที่ 33',
    },
    {
      id: 3,
      image: 'https://www.lannapoly.ac.th/web/gallery/20241119-112515.jpg',
      title: 'โปลิฯ ลุยต่อ! จัดประชุมชี้แจงและมอบผลการเรียนให้กับผู้ปกครองนักศึกษา ปวช.3 ปวส.2',
      description: 'วิทยาลัยเทคโนโลยีโปลิเทคนิคลานนา เชียงใหม่ จัดกิจกรรมประชุมผู้ปกครอง และรับผลการเรียน ของนักศึกษาระดับชั้น ปวช.3 และ ปวส.2 (ช่วงเช้า) เพื่อชี้แจงให้ผู้ปกครองถึงแนวทางการดูแลนักศึกษาในวิทยาลัย โดยมีอาจารย์ประสิทธิ์ ชูดวง รองผู้อำนวยการฝ่ายกิจการนักศึกษา และอาจารย์ครรชิต เมฆขลา รองผู้อำนวยการฝ่ายวิชาการ ร่วมพบปะผู้ปกครองและนักเรียนในวันนี้ ณ อาคารนิกรพันธุ์ วันอาทิตย์ ที่ 17 พฤศจิกายน 2567',
    },
  ];

  return (
    <div className="page-container">
      <h1>กิจกรรมของวิทยาลัยโปลิเทคนิคลานนา เชียงใหม่</h1>
      <div className="content-center">
        {activities.map((activity) => (
          <div key={activity.id} className="card">
            <img src={activity.image} alt={activity.title} />
            <h3>{activity.title}</h3>
            <p>{activity.description}</p>
          </div>
        ))}
      </div>
    </div>
  );
};

export default Activities;

